{
    "person": {
        "name": {
            "first": "Brian",
            "middle": "Jack",
            "last": "Tambara"
        },
        "email": "btambara@gmail.com",
        "github": "https://github.com/btambara",
        "website": "http://briantambara.com",
        "location": {
            "city": "Los Angeles",
            "state": "CA"
        }
    },
    "professional": {
        "title": "Software Developer and Analyst",
        "summary": "Quality-focused application developer with a strong passion for clean, efficient programming and delivering scalable, sustainable solutions. Committed to writing elegant, reusable, and maintainable code that supports long-term success. Brings over 10 years of hands-on experience across the full software development lifecycle, from initial design to deployment. Skilled in leveraging deep expertise in Java, Python, and SQL to enhance user experiences and develop innovative, high-performance applications.",
        "profile": [
            {
                "title": "View time consuming processes and system shortfalls as opportunities to innovate",
                "summary": "Developed applications to automate time-consuming tasks, increase operational efficiency, and eliminate errors caused by manual intervention."
            },
            {
                "title": "Continuously learn and adapt to rapidly evolving and emerging technologies",
                "summary": "Automated process for backing up major studio projects at Deluxe Media. Learned Python and PHP to develop a user-friendly and intuitive web interface."
            },
            {
                "title": "View time consuming processes and system shortfalls as opportunities to innovate",
                "summary": "Refactored codebase to reflect the latest Python 3 changes. Updated all libraries for compatibility. Added typing to most of the codebase. Wrote unit tests to confirm that the changes work correctly."
            }
        ],
        "skill": {
            "core": [
                {
                    "name": "Agile Software Development"
                },
                {
                    "name": "Test-driven development (TDD)"
                },
                {
                    "name": "API Development"
                },
                {
                    "name": "Web Application Development"
                },
                {
                    "name": "CI/CD"
                },
                {
                    "name": "Requirements Analysis"
                },
                {
                    "name": "System Design/Analysis"
                }
            ],
            "progamming": [
                {
                    "name": "Python",
                    "versions": [
                        {
                            "version": "2"
                        },
                        {
                            "version": "3"
                        }
                    ]
                },
                {
                    "name": "Java",
                    "versions": [
                        {
                            "version": "8"
                        },
                        {
                            "version": "11"
                        },
                        {
                            "version": "17"
                        }
                    ]
                },
                {
                    "name": "C#",
                    "versions": [
                        {
                            "version": "6.0"
                        }
                    ]
                },
                {
                    "name": "Typescript",
                    "versions": [
                        {
                            "version": "5"
                        }
                    ]
                },
                {
                    "name": "Javascript",
                    "versions": [
                        {
                            "version": "ES2019"
                        }
                    ]
                }
            ],
            "framework": [
                {
                    "name": "Django"
                },
                {
                    "name": "UiPath"
                },
                {
                    "name": "Mulesoft"
                },
                {
                    "name": "Bootstrap"
                },
                {
                    "name": "jQuery"
                },
                {
                    "name": "AJAX"
                },
                {
                    "name": "React"
                },
                {
                    "name": "Vue"
                }
            ],
            "application": [
                {
                    "name": "Symitar"
                },
                {
                    "name": "Git"
                },
                {
                    "name": "GitLab"
                },
                {
                    "name": "VSCode"
                },
                {
                    "name": "Jira"
                },
                {
                    "name": "Bitbucket"
                }
            ]
        },
        "experience": [
            {
                "title": "Software Developer and Analyst",
                "website": "https://www.premieramerica.com/",
                "company": "Premier America Credit Union",
                "from": "20240601",
                "to": "PRESENT",
                "location": {
                    "city": "Chatsworth",
                    "state": "CA"
                },
                "summary": "Develop solutions using various languages and technologies for internal stakeholders at Premier America. Collaborate with business units to analyze, design workflows, and code solutions to enhance revenue, efficiency, and member experience. Utilize Symitar, SQL, Python, and web frameworks to create internal workflows. Lead planning, design, programming, testing, and support for new processes. Automate business processes, deploy new features, optimize APIs, and orchestrate data exchange. Create reusable code, documentation, provide application support, and collaborate with stakeholders. Handle Continuous Integration deployments, troubleshoot bugs, and address issues at the module level.",
                "profile": [
                    {
                        "summary": "Built a bi-directional Jira–ServiceNow integration using MuleSoft, automating ticket synchronization and eliminating manual entry for development features and bugs—saving time and streamlining cross-functional workflows."
                    },
                    {
                        "summary": "Developed a robotic process automation (RPA) solution that queries financial data from a SQL database to evaluate member compliance with credit union eligibility requirements, enabling automated qualification for Wealth Management services and resolving a key audit finding."
                    },
                    {
                        "summary": "Designed and developed a UiPath robotic process automation to securely download financial data from an sFTP server, enabling automated archiving, parsing with C#, and data ingestion into a SQL database with upsert operations into Wealth Management Salesforce."
                    }
                ],
                "stack": [
                    {
                        "name": "Javascript"
                    },
                    {
                        "name": "Java"
                    },
                    {
                        "name": "Python"
                    },
                    {
                        "name": "Mulesoft"
                    },
                    {
                        "name": "Salesforce"
                    },
                    {
                        "name": "C#"
                    },
                    {
                        "name": "UiPath"
                    },
                    {
                        "name": "SQL"
                    }
                ]
            },
            {
                "title": "Internal Tools Software Engineer (Remote)",
                "company": "ZOO Digital",
                "website": "https://www.zoodigital.com/",
                "from": "20220501",
                "to": "20230801",
                "location": {
                    "city": "Sheffield",
                    "state": "England"
                },
                "summary": "Designed, developed, and maintained scalable internal tools and web applications to support key business operations. Worked as a full-stack engineer, contributing to both front-end and back-end systems. Collaborated in code reviews, performance tuning, and feature development to improve usability and efficiency. Actively managed and enhanced internal systems to meet evolving organizational needs.",
                "profile": [
                    {
                        "summary": "Maintained and enhanced billing, project management, file storage, and asset management applications by troubleshooting issues, implementing new features driven by user feedback, and managing deployments to ensure reliability and performance."
                    },
                    {
                        "summary": "Enhanced version control system for assets used by artists and project managers, implementing approval and rejection workflows with descriptive feedback to streamline asset management and collaboration."
                    },
                    {
                        "summary": "Developed and integrated GitLab CI pipelines to enforce code formatting, linting, unit testing, and security checks—including package vulnerability scanning—enabling the team to deploy frequently with increased confidence and reliability."
                    }
                ],
                "stack": [
                    {
                        "name": "Django"
                    },
                    {
                        "name": "Python"
                    }
                ]
            },
            {
                "title": "Java Developer (Remote)",
                "company": "ZOO Digital",
                "website": "https://www.zoodigital.com/",
                "from": "20200601",
                "to": "20220501",
                "location": {
                    "city": "Sheffield",
                    "state": "England"
                },
                "summary": "Updated and refactored ZOO’s BD-J library and templates to meet the latest Disney specifications and support 4K Ultra HD. Developed and executed test plans for BD-J applications, ensuring high-quality title production. Troubleshot and debugged complex applications, collaborating with cross-functional teams to enhance reliability and performance.",
                "profile": [
                    {
                        "summary": "Developed a production title template generation application that streamlined ZOO’s title production pipeline, significantly improving operational efficiency and throughput."
                    },
                    {
                        "summary": "Led the design and development of the UHD test disc in accordance with Disney specifications, successfully obtaining Disney’s approval and enabling ZOO to initiate UHD title production, generating additional revenue for the company."
                    },
                    {
                        "summary": "Maintained and enhanced a Python application that converts US DVD specification files into international formats, improving productivity and streamlining cross-region compatibility."
                    }
                ],
                "stack": [
                    {
                        "name": "Java"
                    },
                    {
                        "name": "Blu-ray Java"
                    }
                ]
            },
            {
                "title": "Java Developer",
                "company": "Deluxe Media",
                "website": "https://www.bydeluxe.com/",
                "from": "20110701",
                "to": "20181001",
                "location": {
                    "city": "Burbank",
                    "state": "CA"
                },
                "summary": "Develop and maintain specifications for Blu-ray Disc Java (BD-J) title development, including the design and implementation of reusable BD-J libraries and production templates. Create and manage source code, perform thorough testing and debugging of BD-J applications, and develop test plans to support quality control processes. Collaborate closely with clients through regular meetings to communicate project status and adapt to evolving requirements.",
                "profile": [
                    {
                        "summary": "Managed the full project lifecycle for Life of Pi, a high-profile title for 20th Century Fox, and developed a custom BD-J framework for both 3D and 2D formats that seamlessly integrated with Fox’s standard framework to ensure compatibility and maintain studio standards."
                    },
                    {
                        "summary": "Led the design and development of a custom Blu-ray framework for Activision Blizzard’s Collector’s Edition titles, including Diablo III, World of Warcraft: Mists of Pandaria, and StarCraft II: Heart of the Swarm, ensuring a consistent and high-quality user experience across multiple flagship releases."
                    },
                    {
                        "summary": "Migrated an iTunes packaging script from Perl to a Java-based GUI application, modernizing the tool to align with updated studio specifications. Enhanced the application with robust error handling and logging features to detect missing files and improve maintainability."
                    }
                ],
                "stack": [
                    {
                        "name": "Java"
                    },
                    {
                        "name": "Blu-ray Java"
                    }
                ]
            },
            {
                "title": "Java Applications Developer Intern",
                "company": "LigoLab",
                "website": "https://www.ligolab.com/",
                "from": "20100901",
                "to": "20110101",
                "location": {
                    "city": "Glendale",
                    "state": "CA"
                },
                "summary": "Partnered in developing LigoLab-Information Systems, a comprehensive and scalable Laboratory Information System that helps physicians obtain specimen test results faster and track specimen lifecycles more easily. Focused on document imaging, specimen tracking and anatomic pathology aspects of the healthcare application.",
                "profile": [
                    {
                        "summary": "Gained hands-on experience with Java and Swing, applying the Model-View-Controller (MVC) architectural pattern and working with relational databases to develop interactive and structured applications."
                    },
                    {
                        "summary": "Implemented client-driven enhancements by updating database schemas and modifying application logic to support new specimen and group types. Utilized the LigoLab API and made corresponding updates to the GUI to ensure seamless integration and usability."
                    },
                    {
                        "summary": "Worked with a PDF writer API to enhance and modify existing implementations for generating invoices, labels, and requisition documents. Updated PDF template logic to meet evolving business requirements and improve document accuracy and presentation."
                    }
                ],
                "stack": [
                    {
                        "name": "Java"
                    },
                    {
                        "name": "MySQL"
                    }
                ]
            }
        ]
    },
    "education": [
        {
            "degree": "BS in Computer Science",
            "school": {
                "name": "Cal Poly Pomona",
                "city": "Pomona",
                "state": "CA"
            },
            "from": "20090901",
            "to": "20110601"
        },
        {
            "degree": "Coursework, Computer Science",
            "school": {
                "name": "Mt. San Antonio College",
                "city": "Walnut",
                "state": "CA"
            },
            "from": "20060901",
            "to": "20090601"
        }
    ]
}